<?php  if ( ! defined('BASEPATH')) exit('No direct script access allowed');

$config['GONGSABI_GONGJEONG_LIST'] = array(
	'건축',
	'공통가설',
	'토목',
	'기계',
	'전기',
	'통신',
	'소방',
	'부대',
	'조경',
	'제경비',
);

// 공통가설
$config['GONGSABI_GONGJEONG_DATA'][0] = array(
	'공통가설'
);

// 건축
$config['GONGSABI_GONGJEONG_DATA'][1] = array(
	'가설',
	'철근콘크리트',
	'철골',
	'조적',
	'방수',
	'타일',
	'석',
	'목',
	'금속',
	'미장',
	'창호',
	'유리',
	'도장',
	'수장',
	'인테리어',
	'지붕및홈통',
	'가구',
	'가전',
	'잡',
	'관급자재',
);

// 건축
$config['GONGSABI_GONGJEONG_DATA'][1] = array(
	'가설',
	'철근콘크리트',
	'철골',
	'조적',
	'방수',
	'타일',
	'석',
	'목',
	'금속',
	'미장',
	'창호',
	'유리',
	'도장',
	'수장',
	'인테리어',
	'지붕및홈통',
	'가구',
	'가전',
	'잡',
	'관급자재',
);

// 토목
$config['GONGSABI_GONGJEONG_DATA'][2] = array(
	'토공사',
	'파일',
	'흙막이가시설',
);

// 기계
$config['GONGSABI_GONGJEONG_DATA'][3] = array(
	'장비설치',
	'옥외배관',
	'기계실 배관',
	'가스배관',
	'급수급탕배관',
	'가스설비',
	'방진,방음공사',
	'지열공사',
	'엘리베이터 설치공사',
	'공조닥트공사',
	'환기공사',
	'보일러연도설치공사',
	'자동제어공사',
	'배기닥트공사',
	'급,배기덕트설치공사',
	'냉난방기설치공사',
	'동파방지열선공사',
	'EHP공사',
	'G.H.P 설치공사',
	'T.A.B',
	'오배수배관',
	'연도설치',
	'닥트설치',
	'위생기구설치',
	'관급자재',
	'기타',
);

// 전기
$config['GONGSABI_GONGJEONG_DATA'][4] = array(
	'전력간선',
	'동력설비',
	'전등설비',
	'조명및전력제어',
	'전열설비',
	'냉난방(환기) ',
	'접지및피뢰',
	'케이블트레이및덕트',
	'변전실무근및기타건축공사',
	'비상등설비공사',
	'냉난방설비공사',
	'변전실설비공사',
	'동력공사',
	'보안등설비공사',
	'오토리프트전기공사',
	'난방설비공사',
	'옥외전력간선및 보안등공사',
	'수,변전설비공사',
	'인입공사',
	'관급자재',
	'기타',
);

// 통신
$config['GONGSABI_GONGJEONG_DATA'][5] = array(
	'TV',
	'구내통신설비공사(전화,TV,LAN)',
	'A/V설비공사',
	'방송',
	'옥외통신',
	'출입통제',
	'케이블트레이및덕트',
	'통신 TRAY 공사',
	'통합배선',
	'관급자재',
	'기타',
);

// 소방
$config['GONGSABI_GONGJEONG_DATA'][6] = array(
	'기계소방',
	'기타',
	'소화가스',
	'소화내진',
	'소화장비',
	'스프링쿨러',
	'옥내소화배관',
	'유도등',
	'자동화재탐지',
	'관급자재',
);

// 부대
$config['GONGSABI_GONGJEONG_DATA'][7] = array(
	'우,오수',
	'포장',
	'구조물',
	'기타',
	'관급자재',
);

// 부대
$config['GONGSABI_GONGJEONG_DATA'][8] = array(
	'식재',
	'시설물',
	'기타',
	'관급자재',
);